In [6]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [7]:
titles = pd.read_csv('titles.csv', index_col=None)
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [8]:
cast = pd.read_csv('cast.csv', index_col=None)
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [9]:
titles['title'].value_counts()[:10].sort_values(ascending=False)

Hamlet                  18
Carmen                  16
Macbeth                 15
The Outsider            12
Maya                    12
The Three Musketeers    11
Temptation              11
Freedom                 11
Othello                 11
Kismet                  11
Name: title, dtype: int64

In [10]:

n = 10
titles['title'].value_counts()[:n].index.tolist()

['Hamlet',
 'Carmen',
 'Macbeth',
 'Maya',
 'The Outsider',
 'Kismet',
 'Othello',
 'Freedom',
 'Temptation',
 'The Three Musketeers']

### Which three years in the 1930s saw the most films released?

In [11]:
q = titles[titles["year"].between(1930,1939)]
q["year"].value_counts().sort_index(ascending=False).head(3)

1939    1078
1938    1129
1937    1196
Name: year, dtype: int64

### Count the number of films that have been released in each decade over the history of cinema.

In [12]:
q = titles.groupby((titles["year"]//10)*10).count()
q

      title   year
year
1890      3      3
1900     37     37
1910   6512   6512
1920   8797   8797
1930  10097  10097
1940   8576   8576
1950  12711  12711
1960  17515  17515
1970  18714  18714
1980  20243  20243
1990  22225  22225
2000  38713  38713
2010  67977  67977
2020    210    210

### Count the number of "Hamlet" films made in each decade.

In [13]:
q=titles[titles['title'].str.contains("Hamlet")]
print(q)
q = titles.groupby((q["year"]//10)*10).count()
q

                                          title  year
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
6009                                     Hamlet  1948
7670                  Hamlet: Prince of Denmark  1989
8582                                Hamlet (II)  2005
8865                                Hamlet (II)  2015
14317                     Green Eggs and Hamlet  1995
15183                            Hamlet Unbound  2012
15202             Hamlet: The Fall of a Sparrow  2017
17419                 Hamlet, Prince of Denmark  1997
24178                        Han, hun og Hamlet  1932
24284               Intikam Melegi/Kadin Hamlet  1976
37146                                  Hamlet_X  2003
39230                  Hamlet, Son of a Kingpin  2015
42266                               Hamlet (IV)  2016
44682                              Hamlet (III)  2007
45350                                    Hamlet  1990
46721                                    Hamlet  1910
62549                            Redneck Hamlet  2017
71152   The Tragedy of Hamlet Prince of Denmark  2007
72925                        A Sagebrush Hamlet  1919
83789                       Harry, Hamlet and I  2013
92146                                    Hamlet  1976
94355                                    Hamlet  1987
94554                                    Hamlet  2000
98086                                  Hamlet 2  2008
98554                                    Hamlet  1921
99398                        Han, hun og Hamlet  1922
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
102919                                   Hamlet  2011
109367                            Hamlet Frezer  2016
113096                             Hamlet (III)  2016
114431                   Hamlet liikemaailmassa  1987
122704                                   Hamlet  1969
128388                                   Hamlet  1954
143184                            Hamlet A.D.D.  2014
151918                              Fuck Hamlet  1996
163471                              Hamlet (II)  2007
166410                                   Hamlet  1913
167861                            Zombie Hamlet  2012
168965                                   Hamlet  2015
172418                Hamlet the Vampire Slayer  2008
174293                                 Hamlet X  2004
176069                                   Hamlet  2009
182970                                   Hamlet  1964
192443                             H for Hamlet  1993
193914        Royal Shakespeare Company: Hamlet  2016
195089                           Hamlet's Ghost  2015
201291                                   Hamlet  1996
209878                                   Hamlet  1911
211393                           Kitchen Hamlet  2009
221479                                   Hamlet  1973
223568                                   Hamlet  2014
223618                   Hamlet in the Hamptons  2002
227105                              Hamlet (II)  1964

        title  year
year
1910.0      4     4
1920.0      2     2
1930.0      1     1
1940.0      1     1
1950.0      1     1
1960.0      3     3
1970.0      4     4
1980.0      3     3
1990.0      6     6
2000.0     13    13
2010.0     16    16

### Count the number of "Rustler" characters in each decade of the history of film.

In [14]:
q=titles[titles['title'].str.contains("Rustler")]
print(q)
q = titles.groupby((q["year"]//10)*10).count()
q

                              title  year
1623                Rustlers' Ranch  1926
13437               Canyon Rustlers  1925
28405             The Rustler's End  1928
61512           Hi-Jacking Rustlers  1926
65543         Rustlers of the Night  1921
71927   The Boss of Rustler's Roost  1928
83707         The Rustler's Roundup  1933
86273      Rustlers of the Badlands  1945
105487        Trail of the Rustlers  1950
130274   Rustlers of Devil's Canyon  1947
132511             Prairie Rustlers  1945
134442               Water Rustlers  1939
144215        Powder River Rustlers  1949
158270        Black Market Rustlers  1943
163215          Rustlers of Red Dog  1935
163901              Cupid's Rustler  1924
163908         Romance and Rustlers  1925
164348                     Rustlers  1949
166374         Underground Rustlers  1941
169189           Rustler's Paradise  1935
171345             The Law Rustlers  1923
181569          Wild Horse Rustlers  1943
183574               Pinto Rustlers  1936
186922             Rustlers' Valley  1937
188514           Rustler's Round-up  1946
201405           Rustlers' Rhapsody  1985
207014        Rustlers on Horseback  1950
211968            Rustlers' Hideout  1945
223179         Green Horse Rustlers  2016
225452         Bullets for Rustlers  1940
229417         Border City Rustlers  1953

        title  year
year
1920.0      9     9
1930.0      6     6
1940.0     11    11
1950.0      3     3
1980.0      1     1
2010.0      1     1

### Count the number of "Hamlet" characters in each decade.

In [15]:
q=titles[titles['title'].str.contains("Hamlet")]
print(q)
q = titles.groupby((q["year"]//10)*10).count()
q

                                          title  year
4394            Dogg's Hamlet, Cahoot's Macbeth  2005
6009                                     Hamlet  1948
7670                  Hamlet: Prince of Denmark  1989
8582                                Hamlet (II)  2005
8865                                Hamlet (II)  2015
14317                     Green Eggs and Hamlet  1995
15183                            Hamlet Unbound  2012
15202             Hamlet: The Fall of a Sparrow  2017
17419                 Hamlet, Prince of Denmark  1997
24178                        Han, hun og Hamlet  1932
24284               Intikam Melegi/Kadin Hamlet  1976
37146                                  Hamlet_X  2003
39230                  Hamlet, Son of a Kingpin  2015
42266                               Hamlet (IV)  2016
44682                              Hamlet (III)  2007
45350                                    Hamlet  1990
46721                                    Hamlet  1910
62549                            Redneck Hamlet  2017
71152   The Tragedy of Hamlet Prince of Denmark  2007
72925                        A Sagebrush Hamlet  1919
83789                       Harry, Hamlet and I  2013
92146                                    Hamlet  1976
94355                                    Hamlet  1987
94554                                    Hamlet  2000
98086                                  Hamlet 2  2008
98554                                    Hamlet  1921
99398                        Han, hun og Hamlet  1922
102506      Predstava 'Hamleta' u Mrdusi Donjoj  1974
102919                                   Hamlet  2011
109367                            Hamlet Frezer  2016
113096                             Hamlet (III)  2016
114431                   Hamlet liikemaailmassa  1987
122704                                   Hamlet  1969
128388                                   Hamlet  1954
143184                            Hamlet A.D.D.  2014
151918                              Fuck Hamlet  1996
163471                              Hamlet (II)  2007
166410                                   Hamlet  1913
167861                            Zombie Hamlet  2012
168965                                   Hamlet  2015
172418                Hamlet the Vampire Slayer  2008
174293                                 Hamlet X  2004
176069                                   Hamlet  2009
182970                                   Hamlet  1964
192443                             H for Hamlet  1993
193914        Royal Shakespeare Company: Hamlet  2016
195089                           Hamlet's Ghost  2015
201291                                   Hamlet  1996
209878                                   Hamlet  1911
211393                           Kitchen Hamlet  2009
221479                                   Hamlet  1973
223568                                   Hamlet  2014
223618                   Hamlet in the Hamptons  2002
227105                              Hamlet (II)  1964

        title  year
year
1910.0      4     4
1920.0      2     2
1930.0      1     1
1940.0      1     1
1950.0      1     1
1960.0      3     3
1970.0      4     4
1980.0      3     3
1990.0      6     6
2000.0     13    13
2010.0     16    16

In [25]:
cast

                                    title  year  ...                character     n
0                          Closet Monster  2015  ...                  Buffy 4   NaN
1                         Suuri illusioni  1985  ...                   Guests  22.0
2                     Battle of the Sexes  2017  ...          Bobby Riggs Fan  10.0
3                    Secret in Their Eyes  2015  ...          2002 Dodger Fan   NaN
4                              Steve Jobs  2015  ...  1988 Opera House Patron   NaN
...                                   ...   ...  ...                      ...   ...
3634462                           Foxtrot  1988  ...                     D?ra  24.0
3634463  Niceland (Population. 1.000.002)  2004  ...             Woman in Bus  26.0
3634464                         Skammdegi  1985  ...            Hj?krunarkona   9.0
3634465                      U.S.S.S.S...  2003  ...   Afgr.dama ? bens?nst??  17.0
3634466                 Bye Bye Blue Bird  1999  ...        Pensionatv?rtinde   NaN

[3634467 rows x 6 columns]

### What are the 11 most common character names in movie history?

In [24]:
cast['character'].value_counts()[:11].sort_values(ascending=False)

Himself        19600
Dancer         12096
Extra          10953
Reporter        8154
Doctor          7436
Student         7177
Policeman       6883
Party Guest     6742
Nurse           6676
Bartender       6613
Minor Role      6255
Name: character, dtype: int64

                                name                character
0                           Buffy #1                  Buffy 4
1                             Homo $                   Guests
2                            $hutter          Bobby Riggs Fan
3                            $hutter          2002 Dodger Fan
4                            $hutter  1988 Opera House Patron
...                              ...                      ...
3634462            Lilja ??risd?ttir                     D?ra
3634463    Sigr??ur J?na ??risd?ttir             Woman in Bus
3634464           Dalla ??r?ard?ttir            Hj?krunarkona
3634465  Krist?n Andrea ??r?ard?ttir   Afgr.dama ? bens?nst??
3634466                 Rosa ? R?gvu        Pensionatv?rtinde

[3634467 rows x 2 columns]

### Who are the 10 people most often credited as "Herself" in film history?

In [30]:
herself = cast[cast["character"].str.contains("Herself")]
herself["name"].value_counts().head(10)

Queen Elizabeth II                  17
Jacqueline Kennedy                  11
Margaret Thatcher                   10
Joyce Brothers                      10
Hillary Clinton                      8
Pat Nixon                            8
Mary Jo Pehl                         7
Queen Elizabeth the Queen Mother     6
Caroline Kennedy                     6
Princess Margaret                    6
Name: name, dtype: int64

In [43]:
filter=cast['character'].str.contains("Herself")
cast[filter]['name'].value_counts().head(10)

Queen Elizabeth II                  17
Jacqueline Kennedy                  11
Margaret Thatcher                   10
Joyce Brothers                      10
Hillary Clinton                      8
Pat Nixon                            8
Mary Jo Pehl                         7
Queen Elizabeth the Queen Mother     6
Caroline Kennedy                     6
Princess Margaret                    6
Name: name, dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [44]:
filter=cast['character'].str.contains("Himself")
cast[filter]['name'].value_counts().head(10)

Adolf Hitler             116
Richard Nixon             56
John F. Kennedy           46
Ronald Reagan             44
Benito Mussolini          28
Winston Churchill         28
George W. Bush            26
Franklin D. Roosevelt     25
Joseph Stalin             24
Martin Luther King        24
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [45]:
filter=cast['year'] == 1945
cast[filter]['name'].value_counts().head(10)

Emmett Vogan       39
Sam (II) Harris    32
Harold Miller      29
Bess Flowers       29
Nolan Leary        27
Frank O'Connor     27
Franklyn Farnum    26
Larry Steers       25
Pierre Watkin      24
Herman Hack        24
Name: name, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [46]:
filter=cast['year'] == 1985
cast[filter]['name'].value_counts().head(10)

Mammootty        22
Shakti Kapoor    21
Sukumari         20
Aruna Irani      15
Raj Babbar       15
Mohanlal         15
Lou Scheimer     15
Rajesh Khanna    13
Asrani           13
Om Shivpuri      13
Name: name, dtype: int64

### How many roles "Mammootty" has played in each year of his career.

In [50]:
filter=cast['name'].str.contains("Mammootty")
cast[filter]['year'].value_counts()

1985    22
1983    18
1986    18
1984    16
1990    15
2009    12
1989    10
2008     9
1987     9
2010     9
2006     8
2004     8
2007     7
2011     7
1982     7
2012     7
1988     7
2000     7
1991     6
2005     6
2014     6
2015     6
2013     5
1995     5
1994     5
1993     5
1998     4
1999     4
2016     4
1992     3
1996     3
2001     3
2002     3
1981     3
1997     2
1980     2
2003     2
2017     1
1971     1
Name: year, dtype: int64

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [53]:
filter=cast['character'].str.contains("Patron in")
cast[filter]['character'].value_counts().head(10)

Patron in Frisky Rabbit         16
Patron in Chinese Restaurant     9
Patron in the Coffee House       9
Patron in Billiard Parlor        5
Patron in restaurant             4
Patron in Bar                    4
Patron in cabaret                3
Patron in Restaurant             3
Patron in Club                   3
Patron in booth                  2
Name: character, dtype: int64

### What are the 10 most frequent roles that start with the word "Science"?

In [54]:
filter=cast['character'].str.contains("Science")
cast[filter]['character'].value_counts().head(10)

Science Teacher                            60
Science Fair Student                        9
The Science Fair Contestants & Families     9
Science Student                             9
Science Fair Judge                          6
Science Reporter                            5
Science Club Member                         5
Science Kid                                 5
Science Promo Cadet                         5
Science                                     4
Name: character, dtype: int64

### Count number of n-values of the roles that Judi Dench has played over her career.

In [55]:
filter=cast['name'].str.contains("Judi Dench")
cast[filter]['n'].value_counts().head(10)

3.0     6
1.0     6
2.0     6
7.0     4
4.0     4
6.0     4
12.0    3
5.0     2
18.0    2
16.0    2
Name: n, dtype: int64

### Count number of n-values of Cary Grant's roles through his career.

In [56]:
filter=cast['name'].str.contains("Cary Grant")
cast[filter]['n'].value_counts().head(10)

1.0     46
2.0     20
9.0      2
3.0      2
10.0     2
5.0      1
8.0      1
4.0      1
Name: n, dtype: int64

### Count number of n-value of the roles that Sidney Poitier has acted over the years.

In [57]:
filter=cast['name'].str.contains("Sidney Poitier")
cast[filter]['n'].value_counts().head(10)

1.0     21
2.0      8
3.0      6
4.0      3
21.0     1
13.0     1
5.0      1
10.0     1
Name: n, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [68]:
q=cast[cast['n']==1]
q=q[q['year'].between(1950,1959)]
q

                                                    title  ...    n
1886                       Abbott and Costello Go to Mars  ...  1.0
1887            Abbott and Costello in the Foreign Legion  ...  1.0
1888                Abbott and Costello Meet Captain Kidd  ...  1.0
1889     Abbott and Costello Meet Dr. Jekyll and Mr. Hyde  ...  1.0
1890           Abbott and Costello Meet the Invisible Man  ...  1.0
...                                                   ...  ...  ...
3630010                    Mit siebzehn beginnt das Leben  ...  1.0
3632046                                  El vampiro negro  ...  1.0
3632047                                  El vampiro negro  ...  1.0
3632053                                         Marianela  ...  1.0
3632054                                         Valentina  ...  1.0

[9581 rows x 6 columns]

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [69]:
q=cast[cast['n']==2]
q=q[q['year'].between(1950,1959)]
q

                                     title  year  ...          character    n
1128                          Bashi-Achuki  1956  ...       Abdoushahili  2.0
2149                     The Invisible Boy  1957  ...   Dr. Tom Merrinoe  2.0
7119                  A los cuatro vientos  1955  ...       Pablo G?lvez  2.0
7124                          Cuatro copas  1958  ...             Miguel  2.0
9948                    Private's Progress  1956  ...  Doctor at Medical  2.0
...                                    ...   ...  ...                ...  ...
3631897  Karagiozis, o adikimenos tis zois  1959  ...             Marika  2.0
3631898                 Mono gia mia nyhta  1958  ...               Anna  2.0
3632044             El honorable inquilino  1951  ...          Ana Mar?a  2.0
3633374                            El puma  1959  ...            Norte?a  2.0
3634392                 Akdeniz korsanlari  1950  ...              Maria  2.0

[9120 rows x 6 columns]